#!/usr/bin/python
# -*- coding: utf-8 -*-
import request_handler
import util
from models import Video
from app import App
from gandalf import gandalf

class AboutRequestHandler(request_handler.RequestHandler):
    def render_jinja2_template(self, template_name, template_values):
        template_values["selected_nav_link"] = "about"
        request_handler.RequestHandler.render_jinja2_template(self, template_name, template_values)

class ViewAbout(AboutRequestHandler):
    def get(self):
        self.render_jinja2_template('about/about_the_site.html', {
            "selected_id": "the-site",
            "approx_vid_count": Video.approx_count(),
            "gandalf_production_test": gandalf("production_test"),
        })

class ViewAboutTheTeam(AboutRequestHandler):
    def get(self):
        self.render_jinja2_template('about/about_the_team.html', {
            "selected_id": "the-team",
            "team": [["" + item for item in items] for items in TEAM],
            "contributors": ["" + item for item in sorted(CONTRIBUTORS)],
        })

class ViewGettingStarted(AboutRequestHandler):
    def get(self):
        self.render_jinja2_template('about/getting_started.html', {
            "selected_id": "getting-started",
            "approx_vid_count": Video.approx_count(),
            "App": App
        })

class ViewDiscoveryLab(request_handler.RequestHandler):
    def get(self):
        self.render_jinja2_template('about/discovery_lab.html', {
            "selected_id": "discovery-lab"})

class ViewFAQ(AboutRequestHandler):
    def get(self):
        self.render_jinja2_template('about/faq.html', {
            "selected_id": "faq",
            "approx_vid_count": Video.approx_count()
        })

class ViewDownloads(AboutRequestHandler):
    def get(self):
        self.render_jinja2_template('about/downloads.html', {})


TEAM = [
    (u"emanuel", u"עמנואל",
    u"""
    פרופ' עמנואל גרינגרד עבד שנים רבות בחברת י.ב.מ ישראל, השתתף בפיתוח מערכות ההפעלה במעבדות הפיתוח בארה"ב וכן שימש כמנהל היישום של השפות השמיות במרכזי הפיתוח של י.ב.מ בארה"ב.
    בין תפקידיו בארץ ניתן למנות: מנהל הסיוע הטכני, מנהל הקבוצה להסבת תוכנות לעברית, מנהל ארצי של מהנדסי מערכות ומנהל המרכז המדעי של י.ב.מ. ישראל.
    משך עבודתו לימד באוניברסיטאות ולאחר פרישתו מי.ב.מ. יסד את המחלקה להנדסת תוכנה בשנקר – בי"ס גבוה להנדסה ולעיצוב ועמד בראשה שנים רבות.
    עיסוקו הנוכחי הוא במחשבים אישיים, אינטרנט ולימוד מקוון .משמש כמנהל הפרויקט של התאמת תוכנת Moodle לעברית ומרכז התרגום של אקדמיית קהאן לעברית.
    """),
                
    (u"maya", u"מאיה",
    u"""
    ב- 2011, הקימה מאיה את המיזם "אני-10" שהוא אוסף שיעורים ותרגולים בוידאו, בחינם, לשיפור הבנת החומר הנלמד במתמטיקה מכיתה א' - יב'.
    את רב השיעורים הקליטה היא בעצמה ובחלקם נעזרה במספר מורים מוכשרים נוספים. לאורך שנים, לצד עבודתה כאדריכלית, עסקה גם כמורה פרטית בהתנדבות בשכונות מצוקה,
    ובעקבות הצלחתה לגרום לתלמידיה לשפר מאוד את השגיהם בלימודים, החליטה שהיא חיבת למצוא פתרון חינמי ללימוד מתמטיקה במטרה להגיע למספר רב ככל הניתן של תלמידים משכבה סוציואקונומית נמוכה.
    באמצע 2013 היא החלה לשתף פעולה עם אקדמיית קהאן.
    """),

    (u"yarden", u"ירדן",
    u"""
    ירדן אסא גילתה את קהאן אקדמי בעקבות חיפוש ברשת של סרטון שיסביר לה מה זה "בינארי".
    מאז היא מחפשת אנשים שרוצים להירתם ליצירת שינוי בעולם, שיצטרפו אליה.
    היא חגגה השנה 25 והיא לקראת סיום תואר בפסיכולוגיה ומנהל עסקים.
    היא מאד אוהבת את האקדמיה, אבל מרגישה שהגיע הזמן ליצור אקדמיה של העולם החדש.
    היא מתגעגעת לניו-יורק שהייתה לה לבית, אבל אוהבת את ישראל יותר מהכל.
    """),
        
    (u"eran", u"ערן",
    u"""
    ערן חג'ג', 33, תל אביב, יזם ומתכנת מילדות.
    בעברו מילא תפקידי פיתוח וניהול שונים בניהם כ-CTO של ביטוח ישיר.
    כיום מנכ"ל של חברת אלגו-טריידינג, יזם ויועץ לחברות היטק שונות בניהן בינק ו-JFROG,
    אבל יותר מכל אוהב ללמד.
    ערן נדבק בחיידק בעקבות ההרצאה של סאל ב-TED ומאז פועל לקידום הפרוייקט בארץ.
    מאמין גדול ביכולת שינוי לטובה של מערכת החינוך והעולם בכלל ומשתדל לחיות בהווה.
    """),

    (u"ofer", u"עופר",
    u"""
    עופר קורן נתקל לראשונה בקהאן לפני כ-5 שנים, אז עבד באולפני האנימציה של דיסני בקליפורניה, והיה צריך להשלים חסך במטריצות וטרנספורמציות בתלת-מימד.
    מאז הוא כבר חזר לישראל ועובד בחברת IBM כמהנדס תוכנה, ובמקביל מרכז את הפיתוח והתחזוקה של אתר אקדמית קהאן העברית.
    """),

    (u"or", u"אור",
    u"""
    אור כהן, 31, רחובות. מועמד לדוקטורט בפיזיקה במכון ויצמן. בתור אחד שלמד חלק גדול מהתואר הראשון שלו בטכניון דרך הרצאות וידאו, הוא מאמין גדול ביכולת של טכנלוגיה להעניק חינוך ברמה גבוהה שמותאם לכל תלמיד,
    מכל שכבה חברתית ובכל מקום בארץ. מאז ששמע על אקדמית קהאן לפני שנתיים ומאז הוא מתנדב בעמותה בריכוז מערך התרגום והתכנות של התרגילים.
    """),

    (u"roi", u"רועי",
    u"""
    רועי חרמוני נדבק בחיידק ההוראה בזמן הצבא ומאז משתדל לעמוד מול כיתה כמה שיותר.
    מאז ששמע על אקדמיית קהאן הבין שעתיד החינוך בעולם נמצא מול מחשב ולא רק מול המורה.
    מתגורר במושב נורדיה, חובב מוזיקה מושבע ומאמין שאפשר להסביר הכל דרך ביולוגיה.
    """),

    # (u"asaf", u"אסף",
    # u"""
    # אסף גלבוע הוא יזם בנשמה שמתמחה בהפיכת רעיונות טובים לארגונים מצליחים.
    # בחמשת השנים האחרונות אסף הקים וניהל את תמיס יישומי כטב"ם, חברה פורצת דרך שהעבירה את עולם המטוסים הבלתי מאויישים מהספרה הצבאית לספרה האזרחית.
    # בנוסף לפעילותו העסקית לאסף יש תשוקה בוערת לחינוך. בשנתיים האחרונות אסף עובד עם נערים ונערות בערי הפריפריה במסגרת עמותת יוניסטרים,
    # אשר פועלת להעניק למנהיגי העתיד של ארצנו את הביטחון העצמי והאמונה ביכולת שלהם להיות יזמים וליצור עולם טוב יותר.
    # כשהוא לא מנסה לשנות את העולם אסף משחית את זמנו בטיולים ברחבי הארץ והעולם עם אשתו ושון הכלב (גולדן רטריור ויזם בתחום העצמות וכדורי הטניס) וברכיבה על אופני שטח ברחבי ארץ ישראל המדהימה.
    # """),

    # (u"shahar", u"שחר",
    # u"""
    # שחר קידר, בן 30, גר במסילת ציון ונשוי למילה. בימים הוא מתכנת בכיר בחברת סטארטאפ בשם BigPanda.
    # בלילות הוא ישן. פעם חלם להיות מורה, אבל במקום זה, החליט לנצל את התשוקה שלו לטכנולוגיה ולחינוך על מנת לייסד את "אקדמיית קהאן בישראל".
    # """),
]

CONTRIBUTORS = [
    u"אלון חורב",
    u"שי ארליכמן",
    u"אסף גלבוע",
    u"שחר קידר",
    u"אמיר ליס",
    u"גלי פלס",
    u"אלדד ארנון",
    u"שלומית אורגד",
    u"עידו גרינגרד",
    u"רויטל חליף",
    u"מיכאל נירגד-גיא",
    u"מילה קידר",
    u"אורי כהן",
    u"זוהר שינדלמן",
    u"שרון בר-נטע",
    u"חני מנור",
    u"ויקטור פליקשטיין",
    u"יגאל ספיר",
    u"מיקי אליאל",
]